import { Navbar } from '@/widgets/Navbar'

const OfferPage = () => {
	return (
		<div>
			<Navbar />
			<div className='container mx-auto px-4 py-8'>
				<h1 className='text-3xl font-bold text-decor-2 mb-4'>
					ПУБЛИЧНАЯ ОФЕРТА
				</h1>
				<p className='mb-4'>
					Настоящая публичная оферта (далее – «Оферта») является предложением
					Индивидуального предпринимателя (ИНН 753614213399) (далее – «Whai»),
					заключить договор о предоставлении Доступа к Платформе, как это
					определено ниже (далее – «Договор») на условиях, содержащихся в
					Оферте, в соответствии со ст. 437 Гражданского кодекса Российской
					Федерации.
				</p>
				<p className='mb-4'>
					<b>Внимание!</b> Фактом регистрации на Платформе вы выражаете свое
					согласие с условиями Оферты и заключаете Договор с Whai. Внимательно
					ознакомьтесь с Офертой и условиями Договора. Если Вы не согласны с
					условиями настоящей Оферты или не намерены заключать Договор с Whai,
					Вы можете без регистрации и бесплатно знакомиться с содержанием{' '}
					<a href='https://whai.ru' className='text-blue-500 hover:underline'>
						https://whai.ru
					</a>
					, но не сможете использовать функционал Платформы. Для получения
					подробной информации об Whai, пожалуйста, посетите страницу Whai в
					социальной сети telegram по адресу:{' '}
					<a
						href='https://t.me/whai_edu'
						className='text-blue-500 hover:underline'
					>
						https://t.me/whai_edu
					</a>
				</p>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
				</h2>
				<p className='mb-4'>
					Термины, используемые в настоящей Оферте и в заключаемом в результате
					ее акцепта Договоре, имеют нижеследующие значения:
				</p>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>Платформа</b> – принадлежащая Whai технологическая информационная
						система, включающая интерфейс, сайт и программно-аппаратный
						комплекс, включая программы для ЭВМ, которая предоставляет
						Пользователям доступ к Контенту и услугам, создаваемым и
						предоставляемым самой Платформой на основе платного доступа.
					</li>
					<li>
						<b>Сайт</b> – сайт в сети «Интернет», доступ к которому
						обеспечивается по адресу{' '}
						<a href='https://whai.ru' className='text-blue-500 hover:underline'>
							https://whai.ru
						</a>{' '}
						на котором реализуется функционал Платформы для зарегистрированных
						пользователей, представляющий собой совокупность информации,
						текстов, графических элементов, дизайна, изображений,
						фото-видеоматериалов, коммерческих обозначаемых и иных результатов
						интеллектуальной деятельности и средств индивидуализации,
						содержащихся в информационной системе, обеспечивающей доступность
						такой информации пользователям.
					</li>
					<li>
						<b>Пользователь</b> – физическое лицо, (а) использующее Платформу
						для получения Контента и функционала, предоставляемых Платформой, и
						(б) получающее доступ к Платформе на основе платного доступа (по
						подписке).
					</li>
					<li>
						<b>Подписка Пользователя</b> – плата Пользователя за доступ к
						Платформе с целью получения Контента и функционала, создаваемых и
						предоставляемых Платформой, а также использования других
						возможностей Платформы.
					</li>
					<li>
						<b>Правила</b> - определяемые и устанавливаемые время от времени
						Whai правила и условия использования лицами Платформы, в виде
						единого документа или совокупности отдельных документов, по выбору
						Whai, доводимые Whai до сведения лиц любым не запрещенным законом
						способом.
					</li>
					<li>
						<b>Регистрация Пользователя</b> – регистрация Пользователя в
						качестве пользователя Платформы в целях Доступа, проводимая
						посредством Сайта в соответствии с Офертой и Правилами.
					</li>
					<li>
						<b>Услуги</b> – предоставляемые Платформой информационные и иные
						услуги, включая доступ к курсам, размещение Контента и письменное
						взаимодействие, которые Пользователь получает в рамках
						приобретенного объема.
					</li>
					<li>
						<b>Контент</b> – информация и материалы, создаваемые и размещаемые
						Пользователями на Платформе, включая любые материалы, придуманные и
						загруженные самими Пользователями. Платформа не предоставляет
						заранее подготовленные материалы.
					</li>
					<li>
						<b>Доступ</b> – предоставляемая Whai за плату услуга, включающая
						возможность использования функционала Платформы через веб-интерфейс
						или мобильное приложение для получения и оказания Услуг, размещения
						и использования на ней определенной информации, включая Контент,
						использования иных возможностей и функционала Платформы.
					</li>
					<li>
						<b>Создатель контента</b> – пользователь, самостоятельно создающий и
						размещающий консультационные, информационные и иные материалы на
						Платформе, используя ее функциональные возможности.
					</li>
					<li>
						<b>Опция «Автоматическая оплата»</b> – сервис, позволяющий
						Пользователю оплачивать Подписку Пользователя посредством регулярных
						автоматических переводов денежных средств с банковского счета
						Пользователя.
					</li>
				</ul>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					1. ЗАКЛЮЧЕНИЕ ДОГОВОРА. УСЛОВИЯ И ПОРЯДОК АКЦЕПТА
				</h2>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>1.1.</b> Договор о предоставлении Доступа к Платформе между Whai
						и Пользователем заключается путем акцепта Пользователем настоящей
						Оферты.
					</li>
					<li>
						<b>1.2.</b> Акцептом настоящей Оферты является Регистрация
						Пользователя на Платформе, которая рассматривается как полное и
						безоговорочное согласие Пользователя с условиями Оферты без
						каких-либо изъятий или ограничений.
					</li>
					<li>
						<b>1.3.</b> Договор о предоставлении Доступа к Платформе считается
						заключенным с момента успешного прохождения Регистрации Пользователя
						и на условиях действующей на этот момент Оферты, размещенной на
						Сайте.
					</li>
					<li>
						<b>1.4.</b> Пользователь заверяет Whai в том, что на момент
						совершения акцепта настоящей Оферты Пользователь обладает всеми
						правами и полномочиями на заключение и исполнение Договора. Если
						Пользователь является несовершеннолетним, он настоящим заверяет, что
						получил согласие законного представителя, необходимое для заключения
						и исполнения Договора на предусмотренных в нем условиях, в том числе
						согласие на подключение опции «Автоматическая оплата» в соответствии
						с разделом 3 настоящей Оферты.
					</li>
				</ul>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					2. ПРЕДМЕТ ДОГОВОРА
				</h2>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>2.1.</b> Whai в порядке и на условиях настоящей Оферты
						предоставляет Пользователю за плату Доступ к Платформе с целью
						приобретения и получения Услуг, предоставляемых Платформой,
						получения Контента и использования функционала Платформы
					</li>
					<li>
						<b>2.2.</b> Доступ к Платформе предоставляется на условиях
						регулярной ежемесячной или однократной подписки, в зависимости от
						вида Услуг, предоставляемых Платформой, при условии совершения
						Пользователем оплаты за Подписку на период оплаченного Доступа в
						соответствии с установленными тарифами Платформы (Подписка
						Пользователя).
					</li>
					<li>
						<b>2.3.</b> Пользователь, заключивший Договор, до совершения им
						оплаты Подписки Пользователя и получения Услуг, предоставляемых
						Платформой, получает временный бесплатный ограниченный Доступ к
						функционалу Платформы на условиях, указанных в п. 6.3. Договора."
					</li>
					<li>
						<b>2.4.</b> Договор заключается на срок оплаченной Подписки
						Пользователя и автоматически продлевается при условии оплаты
						Пользователем Подписки Пользователя за следующий период Доступа, в
						том числе с использованием опции «Автоматическая оплата», но в любом
						случае прекращается 20 июня 2022 года или ранее - в дату его
						досрочного прекращения в случаях, предусмотренных Договором.
					</li>
				</ul>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					3. ЦЕНА И ПОРЯДОК ОПЛАТЫ
				</h2>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>3.1.</b> Цена Подписки Пользователя устанавливается в
						соответствии с тарифами, размещенными на Сайте.
					</li>
					<li>
						<b>3.2.</b> Оплата Подписки Пользователя производится за каждый
						период Доступа на основании выставленного счета. Оплата Подписки
						может быть произведена одновременно с оплатой других сервисов,
						используемых Пользователем на Платформе, в составе единого платежа.
					</li>
					<li>
						<b>3.3.</b> В случае подключения Пользователем опции «Автоматическая
						оплата», оплата Подписки Пользователя производится автоматически
						посредством ежемесячного (в последний день соответствующего месяца)
						списания денежных средств с банковского счета Пользователя.
						Подключение опции «Автоматическая оплата» осуществляется посредством
						активации кнопки «Автоматическая оплата» в личном кабинете
						Пользователя на Платформе.
					</li>
					<li>
						<b>3.4.</b> В случае подключения Пользователем опции «Автоматическая
						оплата», настоящим Пользователь дает свое согласие и поручение Whai
						или третьему лицу, взимающему плату от имени Whai, на автоматическое
						списание денежных средств с банковского счета Пользователя на
						условиях настоящей Оферты и тарифов, размещенных на Сайте. О
						предстоящем списании денежных средств Пользователь уведомляется в
						личном кабинете Пользователя на Платформе и путем направления письма
						на адрес электронной почты Пользователя за 5 (пять) дней до
						предстоящего списания. В случае недостаточности денежных средств на
						банковском счете Пользователя для оплаты Подписки Пользователя, Whai
						или третье лицо, взимающее плату от имени Whai, вправе повторно
						направить запрос на списание денежных средств с банковской карты
						Пользователя.
					</li>
					<li>
						<b>3.5.</b> Пользователь вправе отказаться от опции «Автоматическая
						оплата» в любой момент посредством деактивации кнопки
						«Автоматическая оплата» в личном кабинете Пользователя на Платформе.
						При этом, денежные средства, переведенные с банковской карты за
						Подписку Пользователя до отключения опции «Автоматическая оплата»,
						Пользователю не возвращаются.
					</li>
					<li>
						<b>3.6.</b> Моментом исполнения обязанности Пользователя по оплате
						Подписки считается момент поступления денежных средств на расчетный
						счет Whai или третьего лица, взимающего плату от имени Whai.
					</li>
					<li>
						<b>3.7.</b> Услуга Whai по предоставлению Доступа считается
						оказанной с момента успешного завершения процедуры Регистрации.
					</li>
					<li>
						<b>3.8.</b> Whai вправе изменять Тарифы и порядок их оплаты путем
						размещения соответствующих новых условий оплаты на Сайте. Новые
						условия применяются исключительно к Подпискам Пользователя,
						приобретенным после вступления новых условий в силу и не
						распространяются на приобретенные ранее и оплаченные Подписки
						Пользователя.
					</li>
				</ul>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					4. ВОЗВРАТ ДЕНЕЖНЫХ СРЕДСТВ
				</h2>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>4.1.</b> Whai возвращает Пользователю стоимость Подписки в
						случае, если это предусмотрено соответствующим тарифом на Подписку
						Пользователя и если Пользователь письменно заявит об отказе от Услуг
						Платформы и от настоящего Договора, при условии, что такое заявление
						поступило в Whai в течение 3 (Трех) дней с момента начала
						предоставления Услуг Платформой.
					</li>
					<li>
						<b>4.2.</b> Возврат стоимости Подписки Пользователю производится в
						течение 10 (Десяти) рабочих дней со дня поступления в Whai
						указанного в п. 4.1 заявления Пользователя, на счет, с которого была
						произведена оплата за Подписку Пользователя. В указанный срок не
						включен срок проведения банком соответствующей операции по
						зачислению денежных средств.
					</li>
					<li>
						<b>4.3.</b> Whai праве вычесть из суммы возвращаемых денежных
						средств и удержать сумму расходов на операции, связанные с
						получением и с возвратом стоимости Подписки Пользователя в т.ч.
						комиссии банка.
					</li>
					<li>
						<b>4.4.</b> Возврат наличными денежными средствами не производится.
					</li>
					<li>
						<b>4.5.</b> Возврат денежных средств в любом случае не
						осуществляется при расторжении Договора по основаниям нарушения
						Пользователем условий Договора (соответствующая сумма денежных
						средств удерживается в качестве неустойки).
					</li>
				</ul>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					5. ПОРЯДОК И УСЛОВИЯ ПРЕДОСТАВЛЕНИЯ ДОСТУПА К ПЛАТФОРМЕ
				</h2>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>5.1.</b> Доступ Пользователя к Платформе осуществляется через
						веб-интерфейс после успешного прохождения Регистрации на Платформе.
					</li>
					<li>
						<b>5.2.</b> Для целей Регистрации Пользователь предоставляет Whai
						следующую информацию: фамилию, имя, мобильный номер телефона, адрес
						электронной почты. Пользователь подтверждает, что предоставляет
						полные и достоверные сведения, а также дает согласие на обработку
						персональных данных. В случае нарушения Пользователем настоящего
						условия Whai вправе отказать в Регистрации, а если Регистрация
						пройдена - немедленно прекратить Доступ к Платформе и расторгнуть
						Договор в одностороннем порядке по основанию нарушения Пользователем
						Договора.
					</li>
					<li>
						<b>5.3.</b> Whai обрабатывает персональные данные Пользователя в
						соответствии с Соглашением об обработке персональных данных,
						размещенном на Сайте.
					</li>
					<li>
						<b>5.4.</b> После успешного завершения Регистрации Пользователю
						предоставляется доступ к его личному кабинету по учетным данным (его
						логину и паролю). На Пользователе лежит обязанность обеспечить
						сохранность учетных данных, а в случае утраты или неправомерного
						доступа к ним третьих лиц, Пользователь обязуется незамедлительно
						сообщить об этом Whai путем направления письма на адрес электронной
						почты{' '}
						<a
							className='text-yellow-5'
							href='mailto:support@whai.ru?subject=Вопрос'
						>
							support@whai.ru
						</a>{' '}
						получении такого письма Whai вправе ограничить Доступ к Платформе по
						учетным данным Пользователя.
					</li>
					<li>
						<b>5.6.</b> Whai не несет ответственность за доступ третьих лиц к
						личному кабинету Пользователя в результате утраты Пользователем
						своих учетных данных. Whai обязуется обеспечивать сохранность
						полученных учетных данных Пользователя в пределах, предусмотренных
						действующим законодательством, на период действия Договора. После
						прекращения Договора учетные данные могут быть уничтожены.
					</li>
					<li>
						<b>5.7.</b> Доступ предоставляется непосредственно
						зарегистрированному Пользователю. Пользователь настоящим заверяет,
						что приобретает Доступ для себя лично и обязуется не передавать
						учетные данные и права Доступа третьим лицам, и не использовать
						Доступ в целях иных чем единоличное и непосредственное его
						использование в соответствии с Договором и Правилами
					</li>
				</ul>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					6. УСЛОВИЯ ИСПОЛЬЗОВАНИЯ ПЛАТФОРМЫ
				</h2>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>6.1.</b> Доступ к Платформе, Контент и функционал Платформы,
						предоставляется на условиях «как есть». Whai вправе улучшать,
						расширять и иным образом изменять функционал Платформы по своему
						усмотрению, не дает никаких гарантий и не несет ответственности в
						отношении того, что Платформа, Контент и функционал Платформы не
						будут соответствовать ожиданиям Пользователя.
					</li>
					<li>
						<b>6.2.</b> Пользователь понимает и соглашается с тем, что время от
						времени в работе Платформы могут происходить технические перерывы, в
						том числе, но не исключительно, приводящие к временной недоступности
						Платформы / размещенного на ней Контента. Whai будет прикладывать
						все разумные и зависящие от Whai усилия для восстановления
						нормального функционирования Платформы в кратчайшие технически
						возможные сроки. Whai вправе приостанавливать работу Платформы
						полностью или частично для проведения обновления, необходимых
						плановых профилактических работ или внеплановых работ в аварийных
						ситуациях.
					</li>
					<li>
						<b>6.3.</b> Пользователь обязуется обеспечить соблюдение минимальных
						технических требований на протяжении всего периода Доступа. Whai не
						отвечает за невозможность Доступа в случае отсутствия технических
						возможностей на стороне Пользователя.
					</li>
					<li>
						<b>6.4.</b> Whai не несет ответственность за невозможность получения
						полного функционала Платформы, за неполучение Пользователем Услуг,
						предоставляемых Платформой, или их ненадлежащее качество, в том
						числе в связи с несоблюдением Пользователем минимальных системных
						требований для ПК или технических проблем с подключением к сети
						«Интернет».
					</li>
					<li>
						<b>6.5.</b> Минимальные системные требования для ПК:
						<ul className='list-disc ml-6 mb-4 text-secondary'>
							<li>
								Для компьютеров под управлением операционных систем Windows:
								Процессор 2,4 ГГц Intel® Pentium®, Celeron®, Core2 Duo или более
								производительный (или аналогичный) для Microsoft® Windows® 10
								(32/64- разрядные версии). 2,0 Гб ОЗУ, не менее 10 Гб свободного
								места на системном диске. Браузер: Google Chrome версии 58.0 или
								выше, Microsoft Internet Explorer 11 или выше Mozilla Firefox 56
								или выше. Порты 1935, 443 и 80 должны быть открыты. Скорость
								интернет-соединения не менее 1024 Кбит/с
							</li>
							<li>
								Для компьютеров под управлением операционной системы macOS:
								<ul className='list-disc ml-6 mb-4'>
									<li>
										Процессор Intel CoreTM Duo 1,83 ГГц или более
										производительный. ОС Mac OS X v10.4, 10.5, 10.6 (Intel) или
										выше. ОЗУ 1 ГБ (рекомендуется 2 ГБ).
									</li>
									<li>
										Браузер: Apple Safari 10 или выше; Mozilla Firefox 9 или
										выше; Google Chrome 58 или выше.
									</li>
								</ul>
							</li>
							<li>
								Независимо от типа ОС: Поддержка стандарта HTML5 на устройстве
								Пользователя.
							</li>
						</ul>
					</li>
					<li>
						<b>6.6.</b> При использовании Платформы Пользователю запрещается:
						<ul className='list-disc ml-6 mb-4'>
							<li>
								<b>6.6.1.</b> пытаться и/или осуществлять адаптацию или иную
								модификацию Платформы и ее содержимого,
							</li>
							<li>
								<b>6.6.2.</b> пытаться и/или каким-либо образом модифицировать
								механизм внутренней защиты Платформы и ее содержимого;
							</li>
							<li>
								<b>6.6.3.</b> использовать любые автоматизированные устройства,
								программы, алгоритмы, методы, которые выполняют функции,
								аналогичные функциям получения доступа, копирования или
								мониторинга любой части Платформы и ее содержимого;
							</li>
							<li>
								<b>6.6.4.</b> пытаться и/или осуществлять действия, направленные
								на дестабилизацию функционирования Платформы и ее содержимого,
								осуществлять попытки несанкционированного доступа к управлению
								Платформой (в том числе получать доступ к разделам, доступ к
								которым возможен только для Whai).
							</li>
						</ul>
					</li>
					<li>
						<b>6.7.</b> Пользователь обязуется не размещать на Платформе и не
						передавать любым способом при использовании Платформы информацию и
						материалы:
						<ul className='list-disc ml-6 mb-4'>
							<li>
								<b>6.7.1.</b> содержащие персональные данные третьих лиц,
							</li>
							<li>
								<b>6.7.2.</b> порочащие честь, достоинство или деловую
								репутацию, а также нарушающие неприкосновенность частной жизни
								третьих лиц,
							</li>
							<li>
								<b>6.7.3.</b> пропагандирующие террористическую деятельность,
								разжигающие межнациональную, расовую или религиозную рознь,
								носящие непристойный характер, содержащие призывы к незаконным
								действиям, и
							</li>
							<li>
								<b>6.7.4.</b> иные, запрещенные или ограниченные в
								распространении в соответствии с законодательством Российской
								Федерации.
							</li>
						</ul>
					</li>
				</ul>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					7. ИНТЕЛЛЕКТУАЛЬНАЯ СОБСТВЕННОСТЬ
				</h2>
				<p className='mb-4'>
					Пользователь признает и соглашается, что исключительные права на
					Контент, содержание Платформы, а также на Платформу и Сайт в полном
					объеме принадлежат Whai. В результате предоставления Доступа к
					Платформе к Пользователю не переходят права на содержание Платформы,
					включая Контент, а также на саму Платформу и Сайт.
				</p>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					8. ОТВЕТСТВЕННОСТЬ
				</h2>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>8.1.</b> За неисполнение или ненадлежащее исполнение обязательств
						по Договору, стороны несут ответственность в соответствии с
						действующим законодательством Российской Федерации и условиями
						Договора.
					</li>
					<li>
						<b>8.2.</b> В случаях, предусмотренных Договором, Whai вправе
						расторгнуть Договор в одностороннем порядке с направлением
						уведомления о расторжении на адрес электронной почты, указанный
						Пользователем при Регистрации и/или путем размещения сообщения в
						личном кабинете Пользователя на Платформе, и прекратить Доступ
						Пользователя к Платформе. Сумма оплаченной Подписки Пользователя не
						возвращается и удерживается Whai в качестве неустойки в
						предусмотренных Договором случаях.
					</li>
					<li>
						<b>8.3.</b> Расторжение Договора по причине нарушения Пользователем
						Договора и удержание стоимости Подписки в качестве неустойки в
						предусмотренных Договором случаях не освобождает Пользователя от
						ответственности перед Whai за причиненные убытки и не зачитывается в
						счет возмещения убытков.
					</li>
					<li>
						<b>8.4.</b> Whai не несет ответственность в случае, если
						предоставленные Пользователем при Регистрации сведения являлись
						неполными и недостоверными и это повлекло за собой невозможность
						исполнения Whai своих обязательств перед Пользователем.
					</li>
					<li>
						<b>8.5.</b> Whai не несет юридической и материальной ответственности
						за качество и своевременность предоставляемых Услуг на Платформе, а
						также за любые действия или бездействие Пользователя. Однако Whai
						может содействовать урегулированию технических или спорных вопросов
						в случае обращения Пользователя, если это связано с использованием
						Платформы и Доступом, и когда это предусмотрено Правилами.
					</li>
				</ul>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					9. ОБСТОЯТЕЛЬСТВА НЕПРЕОДОЛИМОЙ СИЛЫ
				</h2>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>9.1.</b> Стороны освобождаются от ответственности за неисполнение
						или ненадлежащее исполнение обязательств по Договору, если
						надлежащее исполнение оказалось невозможным вследствие непреодолимой
						силы, то есть чрезвычайных и непредотвратимых при данных условиях
						обстоятельств, под которыми понимаются: запретительные действия
						властей, гражданские волнения, эпидемии, блокада, эмбарго,
						землетрясения, наводнения, пожары или другие стихийные бедствия,
						мораторий органов власти и управления, забастовки, террористические
						акты.
					</li>
					<li>
						<b>9.2.</b> В случае наступления указанных обстоятельств, срок
						исполнения стороной обязательств отодвигается соразмерно времени
						действия данных обстоятельств на соответствующую сторону.
					</li>
					<li>
						<b>9.3.</b> Неуведомление или несвоевременное уведомление о
						наступлении обстоятельств непреодолимой силы лишает права любую из
						сторон ссылаться на эти обстоятельства как на основание,
						освобождающее ее от ответственности за неисполнение обязательств по
						отношению к другой стороне.
					</li>
					<li>
						<b>9.4.</b> Если обстоятельства непреодолимой силы продолжают
						действовать более 3-х месяцев, каждая из сторон вправе расторгнуть
						Договор.
					</li>
				</ul>
				<h2 className='text-2xl font-bold text-decor-2 mb-4'>
					10. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ
				</h2>
				<ul className='list-disc ml-6 mb-4'>
					<li>
						<b>10.1.</b> Оферта и Договор регулируются действующим
						законодательством Российской Федерации.
					</li>
					<li>
						<b>10.2.</b> Все споры в связи с заключением, исполнением или
						нарушением Договора разрешаются путем переговоров, а в случае
						недостижения согласия подлежат рассмотрению в суде по месту
						нахождения Whai (договорная подсудность), если это прямо не
						ограничено правилами подсудности, предусмотренными действующим на
						момент обращения в суд законодательством Российской Федерации – в
						таком случае применяются соответствующие правила подсудности.
					</li>
					<li>
						<b>10.3.</b> Whai вправе в одностороннем порядке изменять условия
						Договора путем изменения Оферты. Whai вправе время от времени
						изменять / дополнять Оферту без какого-либо специального
						уведомления. Новая редакция Оферты вступает в силу с даты новой
						редакции Оферты, размещенной на Сайте, с даты такого размещения если
						иное не предусмотрено в соответствующей редакции Оферты.
					</li>
					<li>
						<b>10.4.</b> Whai вправе изменять Договор в предусмотренных в нем
						случаях в одностороннем порядке.
					</li>
					<li>
						<b>10.5.</b> Whai вправе уступить все или любую часть своих прав по
						Договору другому лицу без согласия Пользователя. Пользователь не
						вправе уступать свои права по Договору другому лицу без
						предварительного письменного согласия Whai на такую уступку.
					</li>
					<li>
						<b>10.6.</b> Стороны соглашаются, что письменная форма сделки в
						отношении Договора считается соблюденной в случае ее совершения на
						условиях Оферты с помощью электронных средств на Сайте (ст. 160 ГК
						РФ), при этом не требуется дополнительно совершать собственноручную
						подпись. Whai в качестве подтверждения совершения сделки может
						направлять Пользователю соответствующее сообщение по электронной
						почте.
					</li>
					<li>
						<b>10.7.</b> Стороны соглашаются применять электронную форму
						письменных документов в связи с исполнением Договора, в т.ч. счета,
						уведомления, включая обмен сообщениями посредством Сайта и
						электронной почты. Стороны соглашаются, что такой обмен документами
						является достаточным, письменная форма соблюденной, а передаваемые
						таким образом документы будут иметь для Сторон силу оригиналов.
						Юридически значимые сообщения, которые в силу закона должны быть
						оформлены письменно не в электронной форме, передаются в
						сканированных копиях по электронной почте с последующей передачей
						оригиналов на бумажном носителе.
					</li>
					<li>
						<b>10.8.</b> Для юридически значимых сообщений, адресуемых
						Пользователю, используется информация, предоставленная Пользователем
						при Регистрации и в личном кабинете Пользователя Для юридически
						значимых сообщений, адресуемых Whai используются адреса:
						<ul className='list-disc ml-6 mb-4'>
							<li>
								e-mail:{' '}
								<a
									className='text-yellow-5'
									href='mailto:support@whai.ru?subject=Вопрос'
								>
									support@whai.ru
								</a>
							</li>
						</ul>
					</li>
				</ul>
				<p className='mb-4'>
					Whai является коммерческой организацией, юридическим лицом, созданным
					по законодательству Российской Федерации;{' '}
					<span className='text-yellow-5'>
						ОГРНИП 324750000037516, ИНН 753614213399
					</span>
					. Whai не является образовательной организацией, осуществляющей
					лицензируемую образовательную деятельность (деятельность по реализации
					образовательных программ).
				</p>
				<p className='mb-4'>
					Whai Платформа, доступ к которой предоставляется по настоящей Оферте
					является инновационным проектом. Все права защищены.
				</p>
				<p className='mb-4 text-yellow-5'>Редакция 20 августа 2024 года.</p>
			</div>
		</div>
	)
}

export default OfferPage
